In [2]:
import numpy as np
import pandas as pd

In [4]:
sozluk1 = {"İsim":["Ali","Ayşe","Emir","Fatma"],
           "Spor":["Yüzme","Koşu","Basket","Tenis"],
           "Kalori":[100,200,300,150]
          }

In [5]:
dataFrame1 = pd.DataFrame(sozluk1,index=[0,1,2,3])

In [6]:
dataFrame1

    İsim    Spor  Kalori
0    Ali   Yüzme     100
1   Ayşe    Koşu     200
2   Emir  Basket     300
3  Fatma   Tenis     150

In [8]:
sozluk2 = {"İsim":["Hasan","Dilara","Betül","Buğra"],
           "Spor":["Futbol","Yüzme","Basket","Koşu"],
           "Kalori":[400,220,380,50]
          }

In [11]:
dataFrame2 = pd.DataFrame(sozluk2 , index=[4,5,6,7])

In [12]:
dataFrame2

     İsim    Spor  Kalori
4   Hasan  Futbol     400
5  Dilara   Yüzme     220
6   Betül  Basket     380
7   Buğra    Koşu      50

In [14]:
sozluk3 = {"İsim":["Sema","Erva","Hakan","Gökhan"],
           "Spor":["Badminton","Tenis","Futbol","Futbol"],
           "Kalori":[300,180,260,450]
          }

In [17]:
dataFrame3 = pd.DataFrame(sozluk3 , index=[8,9,10,11])

In [18]:
dataFrame3

      İsim       Spor  Kalori
8     Sema  Badminton     300
9     Erva      Tenis     180
10   Hakan     Futbol     260
11  Gökhan     Futbol     450

## concatenation

In [20]:
pd.concat([dataFrame1,dataFrame2,dataFrame3] , axis=0 )

      İsim       Spor  Kalori
0      Ali      Yüzme     100
1     Ayşe       Koşu     200
2     Emir     Basket     300
3    Fatma      Tenis     150
4    Hasan     Futbol     400
5   Dilara      Yüzme     220
6    Betül     Basket     380
7    Buğra       Koşu      50
8     Sema  Badminton     300
9     Erva      Tenis     180
10   Hakan     Futbol     260
11  Gökhan     Futbol     450

## merge

In [22]:
mergeSozluk = {
                "İsim":["Emir","Fatma","Aybüke","Alparslan"],
                "Spor":["Tenis","Kuşu","Yüzme","Futbol"]
}

In [27]:
mergeDataFrame = pd.DataFrame(mergeSozluk)

In [28]:
mergeDataFrame

        İsim    Spor
0       Emir   Tenis
1      Fatma    Kuşu
2     Aybüke   Yüzme
3  Alparslan  Futbol

In [29]:
mergeSozluk2 = {
                "İsim":["Emir","Fatma","Aybüke","Alparslan"],
                "Kalori":[100,150,200,25]
}

In [30]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [31]:
mergeDataFrame2

        İsim  Kalori
0       Emir     100
1      Fatma     150
2     Aybüke     200
3  Alparslan      25

In [32]:
pd.merge(mergeDataFrame,mergeDataFrame2,on="İsim")

        İsim    Spor  Kalori
0       Emir   Tenis     100
1      Fatma    Kuşu     150
2     Aybüke   Yüzme     200
3  Alparslan  Futbol      25

In [34]:
maasSozluk = {"İsim" : ["Emir","Fatma","Aybüke","Alparslan"],
              "Departman" : ["Yazılım","Sağlık","Sağlık","Elektronik"], 
              "Maaş" : [100,200,300,400]
             }

In [35]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [36]:
maasDataFrame

        İsim   Departman  Maaş
0       Emir     Yazılım   100
1      Fatma      Sağlık   200
2     Aybüke      Sağlık   300
3  Alparslan  Elektronik   400

In [37]:
maasDataFrame["Departman"]

0       Yazılım
1        Sağlık
2        Sağlık
3    Elektronik
Name: Departman, dtype: object

In [38]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Sağlık', 'Elektronik'], dtype=object)

In [39]:
maasDataFrame["Departman"].nunique()

3

In [40]:
maasDataFrame["Departman"].value_counts()

Departman
Sağlık        2
Yazılım       1
Elektronik    1
Name: count, dtype: int64

In [41]:
def buruttenNete(maas):
    return maas * 0.66

In [43]:
maasDataFrame["Maaş"].apply(buruttenNete)

0     66.0
1    132.0
2    198.0
3    264.0
Name: Maaş, dtype: float64

In [44]:
maasDataFrame.isnull() ## null değer varsa true ile gösterir

    İsim  Departman   Maaş
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [54]:
yeniBirVeri = {
                "Karakter Sınıfı" : ["South Park","South Park","Simpson","Simpson","Simpson"],
                "Karakter İsmi" : ["Cartman" , "Kenny" , "Homer" , "Bart","Bart"],
                "Yas" : [10,25,50,28,20]
}

In [55]:
karakterDF = pd.DataFrame(yeniBirVeri)

In [56]:
karakterDF

  Karakter Sınıfı Karakter İsmi  Yas
0      South Park       Cartman   10
1      South Park         Kenny   25
2         Simpson         Homer   50
3         Simpson          Bart   28
4         Simpson          Bart   20

In [57]:
karakterDF.pivot_table(values="Yas",index=["Karakter Sınıfı","Karakter İsmi"])

                               Yas
Karakter Sınıfı Karakter İsmi
Simpson         Bart            24
                Homer           50
South Park      Cartman         10
                Kenny           25